Repository: Thomas-Ghys/thomas-ghys.eu
Catalog: apps/public-site/public/locales/messages.*.xlf
Languages: nl

# locale-switcher.dutch
source: Dutch
nl: Nederlands

# home.title
source: Home
nl: Startpagina

# page404.title
source: Page not found
nl: Pagina niet gevonden

# home.introduction.subtitle
source: Introduction
nl: Introductie

# home.introduction.paragraph.1
source: Welcome, I'm INTERPOLATION. A INTERPOLATION_1 year old from INTERPOLATION_2, INTERPOLATION_3. I possess a deep-seated passion for problem solving and learning, often spending my free time; exploring new (programming) languages and frameworks, solving sudoku's or spending time in strategical (board)games. In addition I love participating in Co-op challenges where communication, collaboration and knowledge sharing are paramount.
nl: Welkom, ik ben INTERPOLATION. Een INTERPOLATION_1 jarige uit INTERPOLATION_2, INTERPOLATION_3. Ik bezit een diepe passie voor probleemoplossing en bijleren, wat vaak terug komt in mijn vrije tijd zoals; het experimenteren met nieuwe (programmeer)-talen en frameworks, het oplossen van sudoku's of het spelen van strategische (bord)spellen. Ook spendeer ik vaak tijd in het doen van Co-op uitdagingen waar communicatie, collaboratie en kennis delen cruciaal zijn.

# home.introduction.paragraph.2
source: Outside the realm of technology, I spend my time reading, gaming, running and maintaining my plants and aquaria.
nl: Buiten de wereld van technologie spendeer ik mijn vrije tijd met lezen, gamen, lopen en het onderhouden van mijn planten en aquaria.

# home.work-competences.subtitle
source: Work competences
nl: Werk competenties

# home.work-competences.paragraph.1
source: Currently I am a Front-End Developer in transition to becoming a Product Owner, with a background in creating dynamic web applications and innovative web development. In little less than 3 years of working in the Front-end, I demonstrated a proficiency in a diverse array of competences including; NgRx, Micro-frontends, Mobile responsiveness, RxJS, Google Material, TypeScript, sass, Angular, etc.
nl: Momenteel ben ik een Front-End developer die in een transistie zit om Product Beheerder te worden, met een achtergrond in het creÃ«ren van dynamische web applicaties en innovatieve web ontwikkelingen. In net geen 3 jaar werken in de Front-End, demonstreerde ik een capaciteit in een gevarieerde reeks van competenties waaronder: NgRx, Micro-frontends, Mobiele responsiviteit, RxJS, Google Material, TypeScript, sass, Angular, enz.

# home.work-competences.paragraph.2
source: My current key achievements include: writing a custom implementation of Google M3, creating and maintaining the Micro-frontend architecture of a new application, migrating to angular-i18n in a Micro-frontend, refactoring and standardisation of components and introducing reusable component libraries, etc. All of these underscore my commitment to excellence, optimisation and continuous learning and improvements.
nl: Mijn huidige belangrijkste prestaties bevatten: het schrijven van een eigen implementatie van Google M3, het uitwerken en onderhouden van een Micro-frontend architectuur in een nieuwe applicatie, migratie doen naar angular-i18n in een Micro-frontend en het standardiseren en herwerken van componenten en de introductie van een herbruikbare componenten biblioteek, enz. Deze zijn allemaal voorbeelden van mijn inspanningen en doelen om te blijven streven voor excellentie, optimalisatie en blijven ontwikkelen en bijleren.

# home.download_cv
source: Download CV
nl: CV downloaden
